#int 整型表示整数，处理人数、年龄等，用int表示，为变量。
a=5
b=128
s=6
# print(a*2+b+5)

#float 浮点型表示小数，处理金额、身高等，用float表示，为变量。
c=3.14
d=5.5
e=6.0
# print(c+d)

#整型和浮点型都是数值型,可以参与数学计算


#str 字符串是一串字符，用来保存普通文本，用str表示，为常量。
#字符串常量使用引号包围
#引号只是字符串的标识，而不是字符串的一部分

s1="hello world"#文本形式的字符串
s2="你好，上海！"#文本形式的字符串
s3="s"#文本形式的字符串
s4="" #空字符串
s5="6" #数值形式的字符串
s6="3.14"#数值形式的字符串
# print(s1+"---"+s2)#其中"---"也是字符串


#bool 布尔值表示真假的判断，用bool表示。
#一个布尔值只有True和False两种值，注意大小写

b1=True #真
b2=False #假
# print(5>3)
# print(6<2)

#None 空值表示什么也没有，用None表示。
n=None


# #函数“type(数据)”可获取该数据的类型，print(type(数据))。
# print(type(s3))
# print(type(b1))
# print(type("b1"))
# print(type(1))